KanguruApp/app/controllers/current_recommendations_controller.rb

  def index
    if CurrentWeather.where("created_at > ?", 1.hour.ago).count > 0
      @weather = CurrentWeather.where("created_at > ?", 1.hour.ago).order("created_at DESC").limit(1)[0]
    else
      @weather = CurrentWeather.create
---
SELECT "current_weathers".* FROM "current_weathers" WHERE (created_at > '2012-06-09 22:37:56.354585') ORDER BY created_at DESC LIMIT 1
SELECT COUNT(*) FROM "current_weathers" WHERE (created_at > '2012-06-09 22:37:41.857643')
INSERT INTO "current_weathers" ("city", "condition", "created_at", "humidity", "json_data", "state", "temperature", "updated_at", "wind_direction", "wind_speed") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?)